MAP_WITH_TEACHERS_ABBREVIATION = {
    "а" : "абакумова", "б" : "богданова", "борз" : "борзенкова",
    "в" : "вдовиченко", "к" : "кузнецова", "кр" : "кряжева-чёрная",
    "л" : "левина", "мак" : "макарова", "мин" : "минаева",
    "о" : "облендер", "п" : "пичугина", "с" : "сотников",
    "сп" : "спицкая", "ц" : "цейтлин", "ш" : "шайдуров",
    "щав" : "щавелев", "щ" : "щеглова", "и" : "иванова",
    "никифорова" : "никифорова", "битюкова" : "битюкова",
    "галиулина" : "галиулина", "борзенкова" : "борзенкова",
    "харсиева" : "харсиева", "маковеев" : "маковеев",
    "андрианова" : "андрианова", "пичугина" : "пичугина",
    "бабакин" : "бабакин", "порецкий" : "порецкий",
    "облендер" : "облендер", "спицкая" : "спицкая",
    "ершова" : "ершова", "абакумова" : "абакумова",
    "пронин" : "пронин", "михайлова" : "михайлова",
    "обуховская" : "обуховская", "кутявин" : "кутявин",
    "зверев" : "зверев", "данилова" : "данилова",
    "минаева" : "минаева", "биологии" : "биологии",
    "студзинский" : "студзинский", "костюченко" : "костюченко",
    "ремнёв" : "ремнёв", "кузнецова" : "кузнецова",
    "лужбинина" : "лужбинина", "цейтлин" : "цейтлин",
    "щавелев" : "щавелев", "розова" : "розова",
    "солынин" : "солынин", "шайдуров" : "шайдуров",
    "антипов" : "антипов", "абросимова" : "абросимова",
    "зиннурова" : "зиннурова", "петерс" : "петерс",
    "иванова" : "иванова", "сотников" : "сотников",
    "теслер" : "теслер", "красоткина" : "красоткина",
    "бикулова" : "бикулова", "артамонова" : "артамонова",
    "тишунин" : "тишунин", "туманова" : "туманова",
    "щеглова" : "щеглова", "макарова" : "макарова",
    "иванов" : "иванов", "нанобашвили" : "нанобашвили",
    "пичугин" : "пичугин", "зайцев" : "зайцев",
    "богданова" : "богданова", "зачиняев" : "зачиняев",
    "левина" : "левина", "пуеров" : "пуеров",
    "клюев" : "клюев", "ханабиев" : "ханабиев",
    "горных" : "горных", "александрова" : "александрова",
    "прохоренко" : "прохоренко", "холодилов" : "холодилов",
    "вдовиченко" : "вдовиченко", "прадун" : "прадун",
    "рожков" : "рожков", "раев" : "раев",
    "тарабукина" : "тарабукина", "дивенков" : "дивенков",
    "литература" : "литература", "крылова" : "крылова",
    "казакова" : "казакова", "травникова" : "травникова",
    "соловьева" : "соловьева"
}

def normalize_key(teacher_name):
    # "(О.)" -> "о", "Костюченко" -> "костюченко"
    ans = ""
    for i in teacher_name.lower():
        if i.isalpha():
            ans += i
    return ans

def get_full_names(teacher_names):
    # Принимает СПИСОК "грязных" сокращений (['(О.)', 'К'])
    # Возвращает СПИСОК имен (['облендер', 'кузнецова'])
    ans = []
    for el in teacher_names:
        key = normalize_key(el)
        if not key: continue
        if key in MAP_WITH_TEACHERS_ABBREVIATION:
            full_name = MAP_WITH_TEACHERS_ABBREVIATION[key]
        else:
            full_name = key
        ans.append(full_name)
    return ans

def parse_teachers(dirty_names):
    # получает строчку из таблицы
    # возвращает кортеж (предмет, [учителя])
    subject = ''
    teachers = [] # грязные сокращения
    # 1 тип - замена учителя
    start = dirty_names.find('(->') # начало (-> Теслер)
    if start != -1:
        end = dirty_names.find(')', start) # конец
        subject = dirty_names[:start].strip() # Все, что между "(->" и ")" - это учителя
        teacher_string = dirty_names[start + 3 : end]
        teacher_clean = teacher_string.strip()
        teachers = teacher_clean.replace(',', ' ').split()
    else:
        # обычный вид
        start = dirty_names.find('(')
        if start != -1:
            end = dirty_names.find(')', start)
            subject = dirty_names[:start].strip()
            teacher_string = dirty_names[start + 1 : end]
            teachers = teacher_string.replace(',', ' ').split()
        # с переносом строки
        elif '\n' in dirty_names:
            parts = dirty_names.split('\n', 1)
            subject = parts[0].strip()
            if len(parts) > 1: # есть ли учителя
                teacher_string = parts[1].strip()
                teachers = teacher_string.replace(',', ' ').split()
            else:
                teachers = []
        # без учителя - просто предмет
        else:
            subject = dirty_names.strip()
            teachers = []
    return (subject, get_full_names(teachers))